{
  "nav": {
    "intro": "Hjem",
    "tech": "Tech",
    "education": "Uddannelse",
    "projects": "Projekter",
    "skills": "Kompetencer",
    "contact": "Kontakt"
  },
  "intro": {
    "teaser": "Fullstack Udvikler med baggrund som underviser",
    "bio1": "Som tidligere underviser i Engelsk og Mediefag har jeg en stærk evne til at formidle komplekse idéer på en enkel måde – og til altid at arbejde med brugeren for øje. Min interesse for kodning startede som et kreativt frirum, og de seneneste par år har jeg målrettet udviklet mine tekniske færdigheder gennem kurser og en bred vifte af hands-on projekter.",
    "bio2": "Jeg elsker at skabe brugerflader, der kombinerer funktionalitet med et skarpt visuelt udtryk – og jeg bliver aldrig træt af at bringe nye idéer til live med kode."
  },
  "tech": {
    "title": "Tech"
  },
  "education": {
    "title": "Uddannelse",
    "items": [
      {
        "title": "Cand.it. i Digitalisering og Applikationsudvikling",
        "year": "2023–2025, Aalborg Universitet",
        "description": "Kandidatuddannelse med fokus på softwareudvikling, digitale teknologier og brugercentreret design. Undervejs har jeg opnået et solidt fundament i programmering og arbejdet projektbaseret med konkrete og praksisnære problemstillinger på tværs af teknologier og programmeringssprog."
      },
      {
        "title": "Technigo Web Development Bootcamp",
        "year": "2023, Technigo",
        "description": "Et intensivt 22-ugers program med fokus på JavaScript (ES6), React, Node.js, Express.js og MongoDB. Under forløbet kodede jeg hver eneste dag og afleverede et nyt projekt hver uge. Uddannelsen bestod af både individuelle og gruppebaserede projekter, med en agil tilgang, masser af mob-/pair-programmering og ugentlige code reviews."
      },
      {
        "title": "Cand.mag. i Engelsk og film & medier",
        "year": "2011–2017, Aarhus Universitet",
        "description": "Uddannelsen gav en solid forståelse for engelsk sprog, litteratur og kultur, kombineret med analytiske og teoretiske perspektiver på film og medier. Studiet udviklede mit kritiske blik, min evne til at formidle komplekse idéer på en klar og struktureret måde, samt mine kommunikative evner - både sprogligt og visuelt."
      }
    ]
  },
  "projects": {
    "title": "Featured Projects",
    "titleAll": "Projects",
    "more": "Flere projekter",
    "projectList": [
      {
        "title": "Normfri Terapi",
        "image": "/projects/normfri.JPG",
        "labels": ["HTML/CSS", "JavaScript", "React", "Redux", "Styled Components", "React Router"],
        "description": "React hjemmeside designet og udviklet for virksomheden Normfri Terapi. \nMålet var at skabe et design, der afspejler virksomhedens farverige og alternative identitet, og samtidigt give en følelse af ro. Hjemmesiden kombinerer et unikt visuelt udtryk med en brugervenlig struktur, hvilket gør den både iøjnefaldende og funktionel.",
        "code": "Se kode",
        "codeLink": "https://github.com/EmmaHoltegaard/norm-fri",
        "demo": "Se demo",
        "demoLink": "https://normfriterapi.dk/"
      },
      {
        "title": "Simpel to-do app",
        "image": "/projects/todo.PNG",
        "labels": ["HTML/CSS", "JavaScript", "React", "Redux"],
        "description": "Dette projekt er en React-baseret to-do-applikation udviklet med Redux til state management. Mens det primære mål var at få praktisk erfaring med Redux og håndtering af global state i React, havde jeg også fokus på det visuelle udtryk og nød at designe en bullet journal-inspireret UI med CSS.",
        "code": "Se kode",
        "codeLink": "https://github.com/EmmaHoltegaard/project-todos",
        "demo": "Se demo",
        "demoLink": "https://spectacular-sunflower-bab07b.netlify.app/"
      },
      {
        "title": "EcoHour",
        "image": "/projects/ecohour.png",
        "labels": ["Java",  "Android", "API calls"],
        "description": "EcoHour er en Android-app udviklet i samarbejde med MinStrøms API. Den fungerer som et planlægningsværktøj, der gør det muligt for brugere at planlægge huslige opgaver baseret på de aktuelle elpriser. Appen blev udviklet som en prototype i forbindelse med et semesterprojekt."
      },
      {
        "title": "Grounding chatbot",
        "image": "/projects/chatbot.png",
        "labels": ["HTML/CSS", "JavaScript"],
        "description": "Som mit allerførste JavaScript-projekt var hovedfokus at lære de grundlæggende principper i JavaScript samt at deploye en webapplikation. Denne chatbot er designet til at vejlede brugere gennem grounding-teknikker for at fremme ro og mindfulness. Den anvender betingede statements og event listeners til at behandle brugerinput og levere svar i realtid.",
        "code": "Se kode",
        "codeLink": "https://github.com/EmmaHoltegaard/project-chatbot",
        "demo": "Se demo",
        "demoLink": "https://grounding-chatbot.netlify.app/"
      },
      {
        "title": "Portfolio website",
        "image": "/projects/portfolio4.png",
        "labels": ["HTML/CSS", "JavaScript", "React", "Vite", "Styled Components"],
        "description": "Dette er det projekt, du kigger på lige nu! Denne portfolio er en specialbygget webapplikation, udviklet fra bunden med React, React Router og Styled Components. Designet er gjort responsivt med media queries, hvilket sikrer tilpasning på tværs af forskellige skærmstørrelser. Projektet fungerer både som en præsentation af mit arbejde og som et eksperiment i at bygge en React-applikation med fokus på moderne front-end teknologier og styling.",
        "code": "View code",
        "codeLink": "https://github.com/EmmaHoltegaard/porfolio-react-vite"
      }
    ]
  },
  "skills": {
    "title": "Kompetencer",
    "code": "Kode",
    "toolbox": "Værktøjer",
    "upcoming": "Kommende",
    "more": "Mere",
    "moreContent": ["Kommunikation", "Formidling", "Projektstyring", "Tekstforfatning", "Koordinering", "Agile metoder", "Scrum"]
  },
  "contact": {
    "call": "Lad os tales ved!"
  }
}