{
  "nav": {
    "intro": "Home",
    "tech": "Tech Stack",
    "education": "Education",
    "projects": "Projects",
    "skills": "Skills",
    "contact": "Contact"
  },
    "intro": {
      "teaser": "Fullstack developer with a background in education",
      "bio1": "As a former English and Media teacher turned developer, I have an instinct for communicating complex ideas and building with the user in mind. My love for coding started as a fun, creative outlet, and over the past few years, I’ve been focused on leveling up my technical skills and experience through a wide variety of hands-on projects.",
      "bio2": "I love building clean, thoughtful interfaces that balance functionality with a strong visual touch—and I’m always excited to bring ideas to life through code."
    },
    "tech": {
      "title": "Tech Stack"
    },
  "education": {
    "title": "Education",
    "items": [
      {
        "title": "MSc in Digitalization and Application Development",
        "year": "2023–2025, Aalborg University",
        "description": "During my 2-year master’s in Digitalization and Application Development, I built a strong foundation in programming and worked hands-on with real-world projects focused on user needs, across many different technologies and programming languages"
      },
      {
        "title": "Technigo Web Development Bootcamp",
        "year": "2023, Technigo",
        "description": "An intensive 22 week program focused on JavaScript (ES6), React, Node.js, Espress.js and MongoDB. During the program I was coding every single day, handing in a new project every week. It was a mix of individual and group projects, with and agile approach, lots of mob/pair-programming and weekly code-reviews."
      },
      {
        "title": "MA in English and Media Studies",
        "year": "2011–2017, Aarhus University",
        "description": "This programme provided a solid foundation in English language, literature, and culture, combined with analytical and theoretical perspectives on film and media. It developed my critical thinking, my ability to communicate complex ideas in a clear and structured way, and strengthened my verbal and visual communication skills."
      }
    ]
  },
    "projects": {
      "title": "Featured Projects",
      "titleAll": "Projects",
      "more": "More Projects",
      "projectList": [
        {
          "title": "Normfri Terapi",
          "image": "/projects/normfri.JPG",
          "labels": ["HTML/CSS", "JavaScript", "React", "Redux", "Styled Components", "React Router"],
          "description": "I designed and developed a website for a small business, Normfri Terapi, from scratch using React. \nThe goal was to create a design that reflects the business's colorful and alternative identity, while maintaining a sense of calm. The website combines a unique visual identity with a user-friendly structure, making it both eye-catching and functional.",
          "code": "View code",
          "codeLink": "https://github.com/EmmaHoltegaard/norm-fri",
          "demo": "Live demo",
          "demoLink": "https://normfriterapi.dk/"
        },
        {
          "title": "Simple To-Do App",
          "image": "/projects/todo.PNG",
          "labels": ["HTML/CSS", "JavaScript", "React", "Redux"],
          "description": "This project is a React-based to-do application built with Redux for state management. While the primary objective was to gain hands-on experience with Redux and managing global state in React, I also focused on the visuals and had fun designing a bullet journal-inspired UI using CSS.",
          "code": "View code",
          "codeLink": "https://github.com/EmmaHoltegaard/project-todos",
          "demo": "Live demo",
          "demoLink": "https://spectacular-sunflower-bab07b.netlify.app/"
        },
        {
          "title": "EcoHour",
          "image": "/projects/ecohour.png",
          "labels": ["Java", "Android", "API calls"],
          "description": "EcoHour is an Android app developed in collaboration with MinStrøm's API. It serves as a planning tool, allowing users to schedule household tasks based on real-time electricity prices. The app was a prototype, developed and tested as part of a semester project."
        },
        {
          "title": "Grounding Chatbot",
          "image": "/projects/chatbot.png",
          "labels": ["HTML/CSS", "JavaScript"],
          "description": "As my very first JavaScript project, the main focus was learning the fundamentals of JavaScript and deploying a web application. This chatbot is designed to guide users through grounding techniques to promote calmness and mindfulness. It utilizes conditional statements and event listeners to process user input and provide real-time responses.",
          "code": "View code",
          "codeLink": "https://github.com/EmmaHoltegaard/project-chatbot",
          "demo": "Live demo",
          "demoLink": "https://grounding-chatbot.netlify.app/"
        },
        {
          "title": "Portfolio Website",
          "image": "/projects/portfolio4.png",
          "labels": ["HTML/CSS", "JavaScript", "React", "Vite", "Styled Components", "i18n", "Multi-language"],
          "description": "This is the project you're viewing right now! This portfolio is a custom-built web application, developed from scratch using React, React Router, and Styled Components. The design is made responsive with media queries, ensuring adaptability across different screen sizes. This project serves both as a showcase of my work and as an experiment in building a React application, focusing on modern front-end technologies and styling.",
          "code": "View code",
          "codeLink": "https://github.com/EmmaHoltegaard/porfolio-react-vite"

        },
        {
          "title": "Guess Who",
          "image": "/projects/placeholder.jpg",
          "labels": ["Java"],
          "description": "This is the projects you're looking at right now!\n I build this portfolio in React"
        },
        {
          "title": "Happy Thoughts",
          "image": "/projects/placeholder.jpg",
          "labels": ["HTML/CSS", "React", "API calls"],
          "description": ".."
        },
        {
          "title": "",
          "image": "/projects/placeholder.jpg",
          "labels": ["HTML/CSS", "React"],
          "description": ".."
        }
      ]
    },
    "skills": {
      "title": "Skills",
      "code": "Code",
      "toolbox": "Toolbox",
      "upcoming": "Upcoming",
      "more": "More",
      "moreContent": ["Communication", "Education", "Project Planning", "Writing", "Coordination", "Agile methodologies", "Scrum"]
    },
    "contact": {
      "call": "Let's talk!"
    }
  }